app/controllers/records_controller.rb

  def index
    @records = Record.all
---
SELECT "records".* FROM "records"

  def create
    @record = Record.new(record_params)
    @record.user = current_user
    authorize @record

    respond_to do |format|
      if @record.save
---
INSERT INTO "records" ("Customer", "Phone", "Time", "Description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @record.update(record_params)
---
UPDATE "records" SET "Phone" = ?, "updated_at" = ? WHERE "records"."id" = ?  [["Phone", 79516673452], ["updated_at", "2018-07-24 18:27:30.958858"], ["id", 1]]

    def set_record
      @record = Record.find(params[:id])
---
SELECT  "records".* FROM "records" WHERE "records"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]